{
    "authors": {
        "Author": [
            "Odininon, RebelKeithy, Shadowclaimer"
        ]
    },
    "categories": [
    ],
    "description": "<div class=\"project-description height-limit text no-tooltip\">\n  <p>\n    <span style=\"font-size:246.2%\">\n      <strong>Agriculture</strong>\n    </span>\n  </p>\n  <p>\n    <span style=\"font-size:184.6%\">A Team Metallurgy Mod</span>\n  </p>\n  <p>By Odininon, RebelKeithy, Shadowclaimer</p>\n  <p>Agriculture is an expansion of the cooking, farming, and hunger systems in core Minecraft. We enhance the act of keeping fed by adding 6+ new machines, 120+ new recipes, and a brand new hunger addition called the \"Well Fed\" system.</p>\n  <p>\n    <span style=\"font-size:184.6%\">Well Fed</span>\n  </p>\n  <p>Anytime you eat a piece of food cooked and processed through our various systems, you will gain \"Well Fed\" points. These points appear on your fatigue bar as a golden highlight on the outside of your fatigue meter that very slowly degrades. There are 20 levels of Well Fed, and each level will grant you +1% swing speed and movement speed.</p>\n  <p>\n    <span style=\"font-size:123.1%\">Machines</span>\n  </p>\n  <p>Agriculture adds a variety of new machines that help you process and cook our food.</p>\n  <p>\n    <strong>The Counter</strong>\n  </p>\n  <p>\n    <img src=\"http://i.imgur.com/kiyDSFd.png\" title=\"http://i.imgur.com/kiyDSFd.png\" alt=\"http://i.imgur.com/kiyDSFd.png\"/>\n  </p>\n  <p>The Counter is the \"crafting table\" of the mod. By accessing it from the top you view the crafting grid. You start by placing the core ingredient/plate-bowl-cup on the far left and then add the additions on the right and it'll automatically combine the ingredients into the appropriate item. By accessing it from the front it is a chest for storing various things.</p>\n  <p>\n    <strong>The Oven</strong>\n  </p>\n  <p>\n    <img src=\"http://i.imgur.com/QjF1f5S.png\" title=\"http://i.imgur.com/QjF1f5S.png\" alt=\"http://i.imgur.com/QjF1f5S.png\"/>\n  </p>\n  <p>The top of the Oven is also a crafting setup similar to the Counter. However from the front it is a special furnace for cooking your food. Fuel it using Coal on the left to heat it up. As ingredients you're trying to cook sit inside of the Oven they slowly cook and then eventually finish, once they're done cooking they can CONTINUE cooking and eveventually burn requiring you to pay attention as they cook! You can adjust the general heat level using the slider on the meter which increases speed (and burn times!) and add more Oven Racks to cook more items at once.</p>\n  <p>\n    <strong>The Processor</strong>\n  </p>\n  <p>\n    <img src=\"http://i.imgur.com/uuw7y0f.png\" title=\"http://i.imgur.com/uuw7y0f.png\" alt=\"http://i.imgur.com/uuw7y0f.png\"/>\n  </p>\n  <p>The processor accepts fuel in the front and items in the top. It will grind multiple items together to create new ingredients.</p>\n  <p>\n    <strong>The Brewer</strong>\n  </p>\n  <p>\n    <img src=\"http://i.imgur.com/CWCQVuJ.png\" title=\"http://i.imgur.com/CWCQVuJ.png\" alt=\"http://i.imgur.com/CWCQVuJ.png\"/>\n  </p>\n  <p>The Brewer heats up liquids and mixes in ingredients with them to generate new liquids. Simply put a bucket of water or milk in the middle to load up the left meter with liquid then add an ingredient in the middle and fuel in the bottom to run it. You can place an empty cup or bucket in the center to take liquid from the right meter.</p>\n  <p>\n    <strong>The Icebox</strong>\n  </p>\n  <p>\n    <img src=\"http://i.imgur.com/2tUNHR6.png\" title=\"http://i.imgur.com/2tUNHR6.png\" alt=\"http://i.imgur.com/2tUNHR6.png\"/>\n  </p>\n  <p>Powered by Snowballs and Ice Blocks, it will slowly freeze various ingredients.</p>\n  <p>\n    <strong>The Frier</strong>\n  </p>\n  <p>\n    <img src=\"http://i.imgur.com/SOQOPtj.png\" title=\"http://i.imgur.com/SOQOPtj.png\" alt=\"http://i.imgur.com/SOQOPtj.png\"/>\n  </p>\n  <p>The Frier is filled with cooking oil and fries food after heating up.</p>\n  <p>\n    <span style=\"font-size:184.6%\">Crops</span>\n  </p>\n  <p>Agriculture adds a variety of new Crops, Spices, and Salt to the world. Salt spawns randomly underwater (similar to Clay). Spices are rare plants that drop bits of their type as you hit them (but lowers their growth stage each hit) when they are at stage 1 they can be broken and replanted on tilled ground. There are no seeds for these, however many you find out in the world is the limit! Right now Cinnamon is the main Spice available with many more planned.</p>\n  <p>Peanuts and Strawberries are also added to Dungeon Chests and are new crops you can plant!</p>\n  <p>\n    <span style=\"font-size:184.6%\">The Recipes</span>\n  </p>\n  <p>There's too many to list here, so for your viewing pleasure feast your eyes on the spreadsheet!</p>\n  <p>\n    <a href=\"https://docs.google.com/spreadsheet/ccc?key=0ApPr023YHYR0dDA4T1ZCSGJwMUsweElQVTBqa1djRHc#gid=1\">https://docs.google.com/spreadsheet/ccc?key=0ApPr023YHYR0dDA4T1ZCSGJwMUsweElQVTBqa1djRHc#gid=1</a>\n  </p>\n  <p>\n    <span style=\"font-size:184.6%\">Downloads</span>\n  </p>\n  <p>View the Files tab at the top</p>\n</div>\n",
    "iconUrl": "",
    "logoUrl": "http://media-curse.cursecdn.com/avatars/0/336/634524036274657236.png",
    "modId": "",
    "name": "Agriculture",
    "nemName": "Agriculture",
    "references": {
    },
    "tags": [
    ],
    "uid": "teammetalurgy.Agriculture",
    "updateUrl": "https://raw.github.com/02JanDal/QuickMod/master/Agriculture.json",
    "versionsUrl": "https://raw.github.com/02JanDal/QuickMod/master/Agriculture.versions.json",
    "websiteUrl": "http://www.curse.com/mc-mods/minecraft/tmagriculture"
}
